
** Script.py

#+begin_src python :results output
  import pandas as pd
  import numpy as np
  import matplotlib.pyplot as plt

  #Import models from scikit learn module:
  from sklearn.model_selection import train_test_split
  from sklearn.tree import DecisionTreeClassifier
  from sklearn import tree

  #Loading the dataset
  df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/car/car.data', names=['buying', 'maint', 'doors', 'persons', 'lug_boot', 'safety', 'accep'])

  # 1a. Take a look at the dataset
  print(df.head())

  # 2a. Setting the target and predictor variables
  df['accep'] = ~(df['accep']=='unacc') #1 is acceptable, 0 is not acceptable
  X = pd.get_dummies(df.iloc[:,0:6])
  y = df['accep']

  ## 1c. Examine the new features
  print(X.columns)
  print(len(X.columns))

  # 2a. Performing the train-test split
  x_train, x_test, y_train, y_test = train_test_split(X, y, random_state=0, test_size=0.2)

  # 2b. Fitting the decision tree classifier
  dt = DecisionTreeClassifier(max_depth=3, ccp_alpha=0.01, criterion='gini')

  dt.fit(x_train, y_train)

  # 3.Plotting the tree
  plt.figure(figsize=(20, 12))
  tree.plot_tree(dt, feature_names = x_train.columns, max_depth=5, class_names = ['unacc', 'acc'], label='all', filled=True)
  plt.tight_layout()
  plt.show()

#+end_src

#+RESULTS:
#+begin_example
  buying  maint doors persons lug_boot safety  accep
0  vhigh  vhigh     2       2    small    low  unacc
1  vhigh  vhigh     2       2    small    med  unacc
2  vhigh  vhigh     2       2    small   high  unacc
3  vhigh  vhigh     2       2      med    low  unacc
4  vhigh  vhigh     2       2      med    med  unacc
Index(['buying_high', 'buying_low', 'buying_med', 'buying_vhigh', 'maint_high',
       'maint_low', 'maint_med', 'maint_vhigh', 'doors_2', 'doors_3',
       'doors_4', 'doors_5more', 'persons_2', 'persons_4', 'persons_more',
       'lug_boot_big', 'lug_boot_med', 'lug_boot_small', 'safety_high',
       'safety_low', 'safety_med'],
      dtype='object')
21
#+end_example

** Script.py

#+begin_src python :results output
  frac_acc = 412/1382
  print(f'Fraction of acceptable cars: {frac_acc}')

  low_safety_class = 'unacc'
  print(f'Cars with low safety: {low_safety_class}')

  sample_class = 'unacc'
  print(f'The classs of the sample car: {sample_class}')
#+end_src

#+RESULTS:
: Fraction of acceptable cars: 0.2981186685962373
: Cars with low safety: unacc
: The classs of the sample car: unacc

** Task 2
Confirm the Gini impurity for the bottom left node. Since this is a non-root node (either a leaf or a split node), the Gini impurity is only calculated for he samples passing through this node, not the entire dataset -hence the number of samples is 449, not 1382.

*Hint*
Use the same formula as above, but observe that the bottom left node has 449 samples with 96 acc and 353 unacc cars. (So p1 = 96/449 and so on.)

#+begin_src python :results output
  gini_root = 1 - ((412/1382)**2 + (1 - (412/1382))**2)
  print(f'Gini impurity root node : {gini_root}')

  gini_bottom_left = 1 - ((96/449)**2 + (1 - (96/449))**2)
  print(f'Gini impurity bottom left node : {gini_bottom_left}')
#+end_src

#+RESULTS:
: Gini impurity root node : 0.41848785606128835
: Gini impurity bottom left node : 0.33618880858725886

** Script.py

#+begin_src python :results output
  #1. Information gain at a pure node (i.e., node with no more branches)
  r = 0.5 #ratio of new split, could be anything
  gini_pure_node = 0
  gini_info_gain = r*gini_pure_node  + (1-r)*gini_pure_node
  print(f'Gini information gain pure node split safety_low >= .5 : {gini_info_gain}')

  #2. Information gain at the 'persons_2 split'
  r_persons_2 =  604/912 #read ratio of the split from the tree
  gini_left_split = 0.434

  gini_right_split = 0

  initial_gini_persons_2 = 0.495

  weighted_gini_persons_2 = r_persons_2 * gini_left_split + (1-r_persons_2) * gini_right_split

  gini_info_gain_persons_2 = initial_gini_persons_2 - weighted_gini_persons_2

  print(f'Gini information gain node persons_2 : {gini_info_gain_persons_2}')

#+end_src

#+RESULTS:
: Gini information gain pure node split safety_low >= .5 : 0.0
: Gini information gain node persons_2 : 0.20757017543859652

** Script.py
#+begin_src python :results output
  # The usual libraries, loading the dataset and performing the train-test split.
  import pandas as pd
  from sklearn.model_selection import train_test_split

  df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/car/car.data', names=['buying', 'maint', 'doors', 'persons', 'lug_boot', 'safety', 'accep'])

  df['accep'] = ~(df['accep']=='unacc') #1 is acceptable, 0 is not acceptable

  X = pd.get_dummies(df.iloc[:,0:6])
  y = df['accep']

  x_train, x_test, y_train, y_test = train_test_split(X, y, random_state=0, test_size=0.2)

  ## Functions to calculate gini impurity and information gain

  def gini(data):
      """calculate the Gini Impurity
      """
      data = pd.Series(data)
      return 1 - sum(data.value_counts(normalize=True)**2)

  def info_gain(left, right, current_impurity):
      """Information Gain associated with creating a node/split data.Input: left, right are data in left branch, right branch, respectively
      current_impurity is the data impurity before splitting into left, right branches
      """
      # weight for gini score of the left branch
      w = float(len(left)) / (len(left) + len(right))
      return current_impurity - w * gini(left) - (1 - w) * gini(right)

  #### ------------------------------------------------

  ## 1. Calculate sample sizes for a split on persons_2
  left = y_train[x_train['persons_2']==0]
  right = y_train[x_train['persons_2']==1]
  len_left = len(left)
  len_right = len(right)
  print ('No. of cars with persons_2 == 0:', len_left)
  print ('No. of cars with persons_2 == 1:', len_right)

  ## 2. Gini impurity calculations
  gi = gini(y_train)
  gini_left = gini(left)
  gini_right = gini(right)

  print(f'Original gini impurity (without splitting): {gi}')
  print(f'Left split gini impurity: {gini_left}')
  print(f'Right split gini impurity: {gini_right}')

  ## 3. Information gain when using feature persons_2
  info_gain_persons_2 = info_gain(left, right, gi)

  print(f'Information gain for persons_2:', info_gain_persons_2)

  ## 4. Which feature split maximizes information gain?
  info_gain_list = []
  for i in x_train.columns:
      left = y_train[x_train[i]==0]
      right = y_train[x_train[i]==1]
      info_gain_list.append([i, info_gain(left, right, gi)])

  info_gain_table = pd.DataFrame(info_gain_list).sort_values(1,ascending=False)
  print(f'Greatest impurity gain at:{info_gain_table.iloc[0,:]}')
  print(info_gain_table)

#+end_src

#+RESULTS:
#+begin_example
No. of cars with persons_2 == 0: 917
No. of cars with persons_2 == 1: 465
Original gini impurity (without splitting): 0.41848785606128835
Left split gini impurity: 0.49485722848081015
Right split gini impurity: 0.0
Information gain for persons_2: 0.09013468781461476
Greatest impurity gain at:0    safety_low
1      0.091603
Name: 19, dtype: object
                 0         1
19      safety_low  0.091603
12       persons_2  0.090135
18     safety_high  0.045116
14    persons_more  0.025261
13       persons_4  0.020254
7      maint_vhigh  0.013622
3     buying_vhigh  0.011001
20      safety_med  0.008480
17  lug_boot_small  0.006758
1       buying_low  0.006519
5        maint_low  0.005343
6        maint_med  0.004197
15    lug_boot_big  0.003913
2       buying_med  0.003338
8          doors_2  0.002021
0      buying_high  0.001094
4       maint_high  0.000530
10         doors_4  0.000423
16    lug_boot_med  0.000386
11     doors_5more  0.000325
9          doors_3  0.000036
#+end_example

** Script.py
#+begin_src python :results output
  import pandas as pd
  import numpy as np
  import matplotlib.pyplot as plt
  import seaborn as sns
  from sklearn.model_selection import train_test_split
  from sklearn.tree import DecisionTreeClassifier

  def gini(data):
      """calculate the Gini Impurity
      """
      data = pd.Series(data)
      return 1 - sum(data.value_counts(normalize=True)**2)

  def info_gain(left, right, current_impurity):
      """Information Gain associated with creating a node/split data. Input: left, right are data in left branch, right branch, respectively. current_impurity is the data impurity before splitting into left, right branches.
      """
      # weight for gini score of the left branch
      w = float(len(left)) / (len(left) + len(right))
      return current_impurity - w * gini(left) - (1 - w) * gini(right)

  df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/car/car.data', names=['buying', 'maint', 'doors', 'persons', 'lug_boot', 'safety', 'accep'])

  df['accep'] = ~(df['accep']=='unacc') #1 is acceptable, 0 if not acceptable

  X = pd.get_dummies(df.iloc[:,0:6])
  y = df['accep']

  x_train, x_test, y_train, y_test = train_test_split(X,y, random_state=0, test_size=0.2)

  y_train_sub = y_train[x_train['safety_low']==0]
  x_train_sub = x_train[x_train['safety_low']==0]

  gi = gini(y_train_sub)
  print(f'Gini impurity at root: {gi}')

  info_gain_list = []
  for i in x_train.columns:
      left = y_train_sub[x_train_sub[i]==0]
      right = y_train_sub[x_train_sub[i]==1]
      info_gain_list.append([i, info_gain(left, right, gi)])

  info_gain_table = pd.DataFrame(info_gain_list).sort_values(1, ascending=False)
  print(f'Greatest impurity gain at:{info_gain_table.iloc[0,:]}')

#+end_src

#+RESULTS:
: Gini impurity at root: 0.49534472145275465
: Greatest impurity gain at:0    persons_2
: 1     0.208137
: Name: 12, dtype: object

** Script.py
#+begin_src python :results output
  import pandas as pd
  import numpy as np
  import matplotlib.pyplot as plt
  import seaborn as sns
  from sklearn.model_selection import train_test_split
  from sklearn.tree import DecisionTreeClassifier
  from sklearn import tree
  from sklearn.metrics import accuracy_score

  df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/car/car.data', names=['buying', 'maint', 'doors', 'persons', 'lug_boot', 'safety', 'accep'])

  df['accep'] = ~(df['accep']=='unacc') #1 is acceptable, 0 if not acceptable

  X = pd.get_dummies(df.iloc[:,0:6])
  y = df['accep']

  x_train, x_test, y_train, y_test = train_test_split(X, y, random_state=0, test_size=0.2)

  ## 1. Create a decision tree and print the parameters
  dtree = DecisionTreeClassifier()
  print(f'Decision Tree Parameters: ', dtree.get_params())

  ## 2. Fit decision tree on training set and print the depth of the tree
  dtree.fit(x_train, y_train)
  print(f'Decision Tree Depth: {dtree.get_depth()}')

  ## 3. Predict on test data and accuracy of model on test set
  y_pred = dtree.predict(x_test)
  print(f'Test set accuracy: {dtree.score(x_test, y_test)}')

#+end_src

#+RESULTS:
: Decision Tree Parameters:  {'ccp_alpha': 0.0, 'class_weight': None, 'criterion': 'gini', 'max_depth': None, 'max_features': None, 'max_leaf_nodes': None, 'min_impurity_decrease': 0.0, 'min_samples_leaf': 1, 'min_samples_split': 2, 'min_weight_fraction_leaf': 0.0, 'random_state': None, 'splitter': 'best'}
: Decision Tree Depth: 11
: Test set accuracy: 0.9826589595375722

** Script.py
#+begin_src python :results output
  import pandas as pd
  import matplotlib.pyplot as plt
  from sklearn.model_selection import train_test_split
  from sklearn.tree import DecisionTreeClassifier
  from sklearn import tree

  ## Loading the data and setting target and predictor variables
  df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/car/car.data', names=['buying', 'maint', 'doors', 'persons', 'lug_boot', 'safety', 'accep'])
  df['accep'] = ~(df['accep']=='unacc') #1 is acceptable, 0 if not acceptable
  X = pd.get_dummies(df.iloc[:,0:6])
  y = df['accep']

  ## Train-test split and fitting the tree
  x_train, x_test, y_train, y_test = train_test_split(X,y, random_state=0, test_size=0.3)
  dtree = DecisionTreeClassifier(max_depth=3)
  dtree.fit(x_train, y_train)

  ## Visualizing the tree
  plt.figure(figsize=(27,12))
  tree.plot_tree(dtree, feature_names = x_train.columns, class_names = ['unacc','acc'], filled=True)
  plt.tight_layout()
  plt.show()

  ## Text-based visualization of the tree (View this in the Output terminal!)
  print(tree.export_text(dtree, feature_names = x_train.columns.tolist()))

#+end_src

#+RESULTS:
#+begin_example
|--- safety_low <= 0.50
|   |--- persons_2 <= 0.50
|   |   |--- maint_vhigh <= 0.50
|   |   |   |--- class: True
|   |   |--- maint_vhigh >  0.50
|   |   |   |--- class: False
|   |--- persons_2 >  0.50
|   |   |--- class: False
|--- safety_low >  0.50
|   |--- class: False

#+end_example

** Script.py

#+begin_src python :results output
  import pandas as pd
  import numpy as np
  import matplotlib.pyplot as plt
  from sklearn.model_selection import train_test_split
  from sklearn.tree import DecisionTreeClassifier
  from sklearn import tree

  df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/car/car.data', names=['buying', 'maint', 'doors', 'persons', 'lug_boot', 'safety', 'accep'])
  df['accep'] = ~(df['accep']=='unacc') #1 is acceptable, 0 if not acceptable

  X = pd.get_dummies(df.iloc[:,0:6])
  y = df['accep']

  x_train, x_test, y_train, y_test = train_test_split(X, y, random_state=0, test_size=0.3)

  ## 1. Two decision trees
  dtree1 = DecisionTreeClassifier()
  dtree1.fit(x_train, y_train)
  dtree1_depth = dtree1.get_depth()
  print(dtree1_depth)

  dtree2 = DecisionTreeClassifier(max_depth=7)
  dtree2.fit(x_train, y_train)
  dtree2_depth = dtree2.get_depth()
  print(dtree2_depth)

  ## 2. Calculate accuracy scores on test data for both trees
  dtree1_score = dtree1.score(x_test, y_test)
  print(f'Test set accuracy tree no max depth: {dtree1_score}') # or accuracy_score(y_test, y_pred)

  dtree2_score = dtree2.score(x_test, y_test)
  print(f'Test set accuracy tree max depth 7: {dtree2_score}') # or accuracy_score(y_test, y_pred)

#+end_src

#+RESULTS:
: 11
: 7
: Test set accuracy tree no max depth: 0.9788053949903661
: Test set accuracy tree max depth 7: 0.9614643545279383
